In [2]:
import warnings
warnings.filterwarnings("ignore")

In [3]:
import pandas as pd

clients = pd.read_csv('../input/clients.csv')
loans = pd.read_csv('../input/loans.csv')
payments = pd.read_csv('../input/payments.csv')

In [4]:
clients.head(3)

   client_id      joined  income  credit_score
0      46109  2002-04-16  172677           527
1      49545  2007-11-14  104564           770
2      41480  2013-03-11  122607           585

In [5]:
loans.head(3)

,client_id,loan_type,loan_amount,repaid,loan_id,loan_start,loan_end,rate
0,46109,home,13672,0,10243,2002-04-16,2003-12-20,2.15
1,46109,credit,9794,0,10984,2003-10-21,2005-07-17,1.25
2,46109,home,12734,1,10990,2006-02-01,2007-07-05,0.68

In [6]:
payments.head(3)

   loan_id  payment_amount payment_date  missed
0    10243            2369   2002-05-31       1
1    10243            2439   2002-06-18       1
2    10243            2662   2002-06-29       0

In [ ]:
import featuretools as ft